read_verilog -sv -formal -overwrite {workspace}/adder0.v
design -reset-vlog; proc;
write_json {workspace}/netlist/adder0.json