read_verilog -sv -formal -overwrite {workspace}/alu2.v
design -reset-vlog; proc;
write_json {workspace}/netlist/alu2.json