read_verilog -sv -formal -overwrite {workspace}/example2.v
design -reset-vlog; proc;
write_json {workspace}/netlist/arithmetic_test.json