read_verilog -sv -formal -overwrite {workspace}/condition.v
design -reset-vlog; proc;
write_json {workspace}/netlist/condition.json