read_verilog -sv -formal -overwrite {workspace}/counter_10.v
design -reset-vlog; proc;
write_json {workspace}/netlist/counter10.json