read_verilog -sv -formal -overwrite {workspace}/diff.v
design -reset-vlog; proc;
write_json {workspace}/netlist/diff.json