read_verilog -sv -formal -overwrite {workspace}/example4.v
design -reset-vlog; proc;
write_json {workspace}/netlist/logic_test.json