read_verilog -sv -formal -overwrite {workspace}/test.v
design -reset-vlog; proc;
write_json {workspace}/netlist/reg_syn1.json