read_verilog -sv -formal -overwrite {workspace}/three_input_and.v
design -reset-vlog; proc;
write_json {workspace}/netlist/three_input_and.json